1. transaction으로 시작되는 파일이 4개 로드
2. transaction_1, transaction_2 데이터프레임 결합(행을 추가)
3. transaction_detail_1, transaction_detail_2 데이터프레임 결합(행을 추가)
4. transaction, transaction_detail 데이터프레임 결합(공통인 컬럼의 값을 기준으로 열을 추가)

In [38]:
import pandas as pd

In [39]:
# read_csv를 이용하여 파일 4개 로드
transaction_1 = pd.read_csv("../csv/transaction_1.csv")
transaction_2 = pd.read_csv("../csv/transaction_2.csv")
transaction_detail_1 = pd.read_csv("../csv/transaction_detail_1.csv")
transaction_detail_2 = pd.read_csv("../csv/transaction_detail_2.csv")

In [40]:
transaction_1.tail()

     transaction_id   price         payment_date customer_id
4995    T0000005108  210000  2019-06-15 02:42:41    HD315748
4996    T0000005109  150000  2019-06-15 03:36:16    HI215420
4997    T0000005110   50000  2019-06-15 03:44:06    IK880102
4998    T0000005111  210000  2019-06-15 04:14:06    IK074758
4999    T0000005112   50000  2019-06-15 04:42:38    HD444151

In [41]:
transaction_2.tail()

     transaction_id   price         payment_date customer_id
1781    T0000006894  180000  2019-07-31 21:20:44    HI400734
1782    T0000006895   85000  2019-07-31 21:52:48    AS339451
1783    T0000006896  100000  2019-07-31 23:35:25    OA027325
1784    T0000006897   85000  2019-07-31 23:39:35    TS624738
1785    T0000006898   85000  2019-07-31 23:41:38    AS834214

### concat()
1. concat함수는 데이터프레임을 결합 함수
2. axis 0, 1 설정을 하면 행을 추가, 열을 추가할 수 있습니다. (기본값은 행을 추가)
3. 단순하게 행을 합치거나 열을 합치는 기능.
4. ignore_index는 기본값이 false 단순 결합이기때문에 데이터프레임의 인덱스 값도 그대로 유지해서 결합. True 변경시 인덱스값을 초기화하여 다시 부여.

In [42]:
transaction = pd.concat([transaction_1, transaction_2], ignore_index=True)

In [43]:
## transaction_detail 데이터프레임 2개를 각자 합쳐봅시다. 
transaction_detail = pd.concat([transaction_detail_1, transaction_detail_2], ignore_index=True)

In [44]:
df = pd.DataFrame({'S1' : [1,2,3,4],
                    'S2' : [5,6,7,8]})
df

   S1  S2
0   1   5
1   2   6
2   3   7
3   4   8

In [45]:
df_2 = pd.DataFrame([1,2])
df_2

   0
0  1
1  2

In [46]:
pd.concat([df, df_2], axis=0)

    S1   S2    0
0  1.0  5.0  NaN
1  2.0  6.0  NaN
2  3.0  7.0  NaN
3  4.0  8.0  NaN
0  NaN  NaN  1.0
1  NaN  NaN  2.0

### merge()
1. 데이터프레임 결합 함수
2. 특정 조건을 가지고 열 추가

In [47]:
transaction.head()

  transaction_id   price         payment_date customer_id
0    T0000000113  210000  2019-02-01 01:36:57    PL563502
1    T0000000114   50000  2019-02-01 01:37:23    HD678019
2    T0000000115  120000  2019-02-01 02:34:19    HD298120
3    T0000000116  210000  2019-02-01 02:47:23    IK452215
4    T0000000117  170000  2019-02-01 04:33:46    PL542865

In [48]:
transaction_detail.head()

   detail_id transaction_id item_id  quantity
0          0    T0000000113    S005         1
1          1    T0000000114    S001         1
2          2    T0000000115    S003         1
3          3    T0000000116    S005         1
4          4    T0000000117    S002         2

In [49]:
join_data = pd.merge(transaction_detail, transaction, on="transaction_id", how='inner')

In [72]:
jd = pd.merge(transaction_detail, transaction, on="transaction_id", how='inner')

In [50]:
df = pd.DataFrame({"id" : [1,1,3,4,5],
                    "item" : ["a", "b", "a", "a", "c"]})
df

   id item
0   1    a
1   1    b
2   3    a
3   4    a
4   5    c

In [51]:
df_2 = pd.DataFrame({'id' : [1,2,3,4,5], 
                    'name' : ["kim", "lee", "park", "choi", "lim"]})
df_2

   id  name
0   1   kim
1   2   lee
2   3  park
3   4  choi
4   5   lim

In [52]:
pd.merge(df, df_2, on="id", how="inner")

   id item  name
0   1    a   kim
1   1    b   kim
2   3    a  park
3   4    a  choi
4   5    c   lim

In [53]:
pd.concat([df, df_2], axis=1)

   id item  id  name
0   1    a   1   kim
1   1    b   2   lee
2   3    a   3  park
3   4    a   4  choi
4   5    c   5   lim

1. join_data(데이터프레임 4개를 합친 데이터) customer_master.csv, item_master.csv 두 파일을 로드에서 join_data 열을 추가
2. quantity, item_price 곱한 값을 _price 파생변수를 생성
3. payment_date 컬럼의 값을 시계열 데이터로 변경

In [54]:
customer_master = pd.read_csv("../csv/customer_master.csv")
customer_master.head(1)

,customer_id,customer_name,registration_date,email,gender,age,birth,pref
0,IK152942,김서준,2019-01-01 0:25,hirata_yuujirou@example.com,M,29,1990-06-10,대전광역시

In [55]:
join_data.head(1)

,detail_id,transaction_id,item_id,quantity,price,payment_date,customer_id
0,0,T0000000113,S005,1,210000,2019-02-01 01:36:57,PL563502

In [56]:
item_master = pd.read_csv("../csv/item_master.csv")
item_master.head(1)

  item_id item_name  item_price
0    S001      PC-A       50000

In [57]:
join_data = pd.merge(join_data, customer_master, on="customer_id", how="inner")

In [58]:
join_data = pd.merge(join_data, item_master, on="item_id", how="inner")

In [60]:
join_data["_price"] = join_data["quantity"] * join_data["item_price"]

In [ ]:
join_data[["quantity", "item_price", "price", "_price"]].tail(10)

In [ ]:
join_data["payment_date"] = pd.to_datetime(join_data["payment_date"])
join_data["payment_date"]

1. payment_date 컬럼에서 년과 월 부분만 추출해서 payment_month 파생변수 생성

In [71]:
join_data["payment_month"] = join_data["payment_date"].dt.strftime("%Y%m")
join_data[["payment_date", "payment_month"]].head()

         payment_date payment_month
0 2019-02-01 01:36:57        201902
1 2019-04-30 02:39:00        201904
2 2019-04-30 02:39:00        201904
3 2019-02-01 02:47:23        201902
4 2019-02-19 19:48:24        201902

### payment_month 만든 이유는 무엇일까?
> 월별 데이터를 출력이 가능하다.

In [ ]:
## 월별 price의 합에 대한 데이터프레임 생성
join_data.groupby("payment_month").sum()["price"]

In [ ]:
## 월별, 상품별 price의 합계 생성

join_data.groupby(["payment_month", "item_name"]).sum()["price"]